Белгипрозем_2017/src/Documents/УничтожениеДел/УничтожениеДел.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УничтожениеДел</name>
  <registerRecords>InformationRegister.СостоянияДелХраненияДокументов</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеРБ</name>
    <comment>Подразделение</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДелаХраненияДокументов</name>
    <attributes>
      <name>ДелоХраненияДокументов</name>
      <type>
        <types>CatalogRef.ДелаХраненияДокументов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/InformationRegisters/СостоянияДелХраненияДокументов/СостоянияДелХраненияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияДелХраненияДокументов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияДелХраненияДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>ДелоХраненияДокументов</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Enums/КатегорииДел/КатегорииДел.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КатегорииДел</name>
  <enumValues>
    <name>ВременноеДо10</name>
  </enumValues>
  <enumValues>
    <name>ВременноеСвыше10</name>
  </enumValues>
  <enumValues>
    <name>Постоянное</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Enums/СостоянияДелХраненияДокументов/СостоянияДелХраненияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДелХраненияДокументов</name>
  <enumValues>
    <name>ПереданоВАрхив</name>
  </enumValues>
  <enumValues>
    <name>Уничтожено</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Documents/УничтожениеДел/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ИспользоватьУчетПоОрганизациям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям");
	
	Для Каждого Строка Из ДелаХраненияДокументов Цикл
		
		Если ИспользоватьУчетПоОрганизациям Тогда
			Если ЗначениеЗаполнено(Строка.ДелоХраненияДокументов) И Строка.ДелоХраненияДокументов.Организация <> Организация Тогда 
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Дело ""%1"" не относится к организации ""%2"".'"),
					Строка.ДелоХраненияДокументов,
					Организация);
					
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					"ДелаХраненияДокументов[" + Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].ДелоХраненияДокументов",, 
					Отказ);
			КонецЕсли;	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Строка.ДелоХраненияДокументов) И (Не Строка.ДелоХраненияДокументов.ДелоЗакрыто) Тогда 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Дело ""%1"" не является закрытым.'"),
				Строка.ДелоХраненияДокументов);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				"ДелаХраненияДокументов[" + Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].ДелоХраненияДокументов",, 
				Отказ);
		КонецЕсли;
		
		СрокХранения = Строка.ДелоХраненияДокументов.НоменклатураДел.СрокХранения;
		Если ЗначениеЗаполнено(Строка.ДелоХраненияДокументов) И ТипЗнч(СрокХранения) = Тип("Число") Тогда 
			ХранитсяПолныхЛет = Год(Дата) - Год(Строка.ДелоХраненияДокументов.ДатаОкончания) - 1;
			Если ХранитсяПолныхЛет < СрокХранения Тогда 
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Для дела ""%1"" не истек срок хранения.'"),
					Строка.ДелоХраненияДокументов);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,
					ЭтотОбъект,
					"ДелаХраненияДокументов[" + Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].ДелоХраненияДокументов",, 
					Отказ);
			КонецЕсли;	
		КонецЕсли;	
		
		КатегорияДела = Строка.ДелоХраненияДокументов.НоменклатураДел.КатегорияДела;
		Если КатегорияДела = Перечисления.КатегорииДел.Постоянное Тогда 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Дело ""%1"" имеет постоянный срок хранения.'"),
				Строка.ДелоХраненияДокументов);
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				"ДелаХраненияДокументов[" + Формат(Строка.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].ДелоХраненияДокументов",, 
				Отказ);
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.СостоянияДелХраненияДокументов.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДелаХраненияДокументов.НомерСтроки КАК НомерСтроки,
	|	ДелаХраненияДокументов.Ссылка.Дата КАК Период,
	|	ДелаХраненияДокументов.ДелоХраненияДокументов КАК ДелоХраненияДокументов,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияДелХраненияДокументов.Уничтожено) КАК Состояние,
	|	СостоянияСрезПоследних.Состояние КАК СостояниеРанее
	|ИЗ
	|	Документ.УничтожениеДел.ДелаХраненияДокументов КАК ДелаХраненияДокументов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияДелХраненияДокументов.СрезПоследних(&Период, ДелоХраненияДокументов В (&ДелаХраненияДокументов)) КАК СостоянияСрезПоследних
	|		ПО ДелаХраненияДокументов.ДелоХраненияДокументов = СостоянияСрезПоследних.ДелоХраненияДокументов
	|ГДЕ
	|	ДелаХраненияДокументов.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("ДелаХраненияДокументов", ДелаХраненияДокументов.ВыгрузитьКолонку("ДелоХраненияДокументов"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.СостояниеРанее = Перечисления.СостоянияДелХраненияДокументов.Уничтожено Тогда 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Дело ""%1"" было уничтожено ранее.'"),
				Выборка.ДелоХраненияДокументов);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				ЭтотОбъект,
				"ДелаХраненияДокументов[" + Формат(Выборка.НомерСтроки - 1, "ЧН=0; ЧГ=0") + "].ДелоХраненияДокументов",, 
				Отказ);
		КонецЕсли;
		
		Движение = Движения.СостоянияДелХраненияДокументов.Добавить();
		Движение.Период = Выборка.Период;
		Движение.ДелоХраненияДокументов = Выборка.ДелоХраненияДокументов;
		Движение.Состояние = Выборка.Состояние;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда 
		
		Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		
		Если Не ЗначениеЗаполнено(Организация) Тогда 
			Организация = РаботаСОрганизациями.ПолучитьОрганизациюПоУмолчанию();
		КонецЕсли;
		
	КонецЕсли;	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда 
		Для Каждого Дело Из ДанныеЗаполнения Цикл
			НоваяСтрока = ДелаХраненияДокументов.Добавить();
			НоваяСтрока.ДелоХраненияДокументов = Дело;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
